PinguinoIDE/pinguino-compilers/linux64/p8/share/gputils/header/p18lf25k40.inc
        LIST

;==========================================================================
; Build date : Feb 01 2016
;  MPASM PIC18LF25K40 processor include
; 
;  (c) Copyright 1999-2016 Microchip Technology, All rights reserved
;==========================================================================

        NOLIST

;==========================================================================
;  This header file defines configurations, registers, and other useful
;  bits of information for the PIC18LF25K40 microcontroller.  These names
;  are taken to match the data sheets as closely as possible.
;
;  Note that the processor must be selected before this file is included.
;  The processor may be selected the following ways:
;
;       1. Command line switch:
;               C:\MPASM MYFILE.ASM /PIC18LF25K40
;       2. LIST directive in the source file
;               LIST   P=PIC18LF25K40
;       3. Processor Type entry in the MPASM full-screen interface
;       4. Setting the processor in the MPLAB Project Dialog
;==========================================================================

;==========================================================================
;
;       Verify Processor
;
;==========================================================================
        IFNDEF __18LF25K40
           MESSG "Processor-header file mismatch.  Verify selected processor."
        ENDIF

;==========================================================================
;       18xxxx Family        EQUates
;==========================================================================
FSR0             EQU  0
FSR1             EQU  1
FSR2             EQU  2

FAST             EQU  1

W                EQU  0
A                EQU  0
ACCESS           EQU  0
BANKED           EQU  1
;==========================================================================

;==========================================================================
;       16Cxxx/17Cxxx Substitutions
;==========================================================================
  #define DDRA  TRISA      ; PIC17Cxxx SFR substitution
  #define DDRB  TRISB      ; PIC17Cxxx SFR substitution
  #define DDRC  TRISC      ; PIC17Cxxx SFR substitution
  #define DDRD  TRISD      ; PIC17Cxxx SFR substitution
  #define DDRE  TRISE      ; PIC17Cxxx SFR substitution

;==========================================================================
;
;       Register Definitions
;
;==========================================================================

;----- Register Files -----------------------------------------------------
PPSLOCK          EQU  H'0EA0'
INT0PPS          EQU  H'0EA1'
INT1PPS          EQU  H'0EA2'
INT2PPS          EQU  H'0EA3'
T0CKIPPS         EQU  H'0EA4'
T1CKIPPS         EQU  H'0EA5'
T1GPPS           EQU  H'0EA6'
T3CKIPPS         EQU  H'0EA7'
T3GPPS           EQU  H'0EA8'
T5CKIPPS         EQU  H'0EA9'
T5GPPS           EQU  H'0EAA'
T2INPPS          EQU  H'0EAB'
T4INPPS          EQU  H'0EAC'
T6INPPS          EQU  H'0EAD'
ADACTPPS         EQU  H'0EAE'
CCP1PPS          EQU  H'0EAF'
CCP2PPS          EQU  H'0EB0'
CWG1PPS          EQU  H'0EB1'
CWGINPPS         EQU  H'0EB1'
MDCARLPPS        EQU  H'0EB2'
MDCARHPPS        EQU  H'0EB3'
MDSRCPPS         EQU  H'0EB4'
RXPPS            EQU  H'0EB5'
TXPPS            EQU  H'0EB6'
SSP1CLKPPS       EQU  H'0EB7'
SSPCLKPPS        EQU  H'0EB7'
SSP1DATPPS       EQU  H'0EB8'
SSPDATPPS        EQU  H'0EB8'
SSP1SSPPS        EQU  H'0EB9'
SSPSSPPS         EQU  H'0EB9'
IPR0             EQU  H'0EBA'
IPR1             EQU  H'0EBB'
IPR2             EQU  H'0EBC'
IPR3             EQU  H'0EBD'
IPR4             EQU  H'0EBE'
IPR5             EQU  H'0EBF'
IPR6             EQU  H'0EC0'
IPR7             EQU  H'0EC1'
PIE0             EQU  H'0EC2'
PIE1             EQU  H'0EC3'
PIE2             EQU  H'0EC4'
PIE3             EQU  H'0EC5'
PIE4             EQU  H'0EC6'
PIE5             EQU  H'0EC7'
PIE6             EQU  H'0EC8'
PIE7             EQU  H'0EC9'
PIR0             EQU  H'0ECA'
PIR1             EQU  H'0ECB'
PIR2             EQU  H'0ECC'
PIR3             EQU  H'0ECD'
PIR4             EQU  H'0ECE'
PIR5             EQU  H'0ECF'
PIR6             EQU  H'0ED0'
PIR7             EQU  H'0ED1'
WDTCON0          EQU  H'0ED2'
WDTCON1          EQU  H'0ED3'
WDTPSL           EQU  H'0ED4'
WDTPSH           EQU  H'0ED5'
WDTTMR           EQU  H'0ED6'
CPUDOZE          EQU  H'0ED7'
OSCCON1          EQU  H'0ED8'
OSCCON2          EQU  H'0ED9'
OSCCON3          EQU  H'0EDA'
OSCSTAT          EQU  H'0EDB'
OSCSTAT1         EQU  H'0EDB'
OSCEN            EQU  H'0EDC'
OSCTUNE          EQU  H'0EDD'
OSCFRQ           EQU  H'0EDE'
BORCON           EQU  H'0EE0'
PMD0             EQU  H'0EE1'
PMD1             EQU  H'0EE2'
PMD2             EQU  H'0EE3'
PMD3             EQU  H'0EE4'
PMD4             EQU  H'0EE5'
PMD5             EQU  H'0EE6'
RA0PPS           EQU  H'0EE7'
RA1PPS           EQU  H'0EE8'
RA2PPS           EQU  H'0EE9'
RA3PPS           EQU  H'0EEA'
RA4PPS           EQU  H'0EEB'
RA5PPS           EQU  H'0EEC'
RA6PPS           EQU  H'0EED'
RA7PPS           EQU  H'0EEE'
RB0PPS           EQU  H'0EEF'
RB1PPS           EQU  H'0EF0'
RB2PPS           EQU  H'0EF1'
RB3PPS           EQU  H'0EF2'
RB4PPS           EQU  H'0EF3'
RB5PPS           EQU  H'0EF4'
RB6PPS           EQU  H'0EF5'
RB7PPS           EQU  H'0EF6'
RC0PPS           EQU  H'0EF7'
RC1PPS           EQU  H'0EF8'
RC2PPS           EQU  H'0EF9'
RC3PPS           EQU  H'0EFA'
RC4PPS           EQU  H'0EFB'
RC5PPS           EQU  H'0EFC'
RC6PPS           EQU  H'0EFD'
RC7PPS           EQU  H'0EFE'
IOCAF            EQU  H'0F0A'
IOCAN            EQU  H'0F0B'
IOCAP            EQU  H'0F0C'
INLVLA           EQU  H'0F0D'
SLRCONA          EQU  H'0F0E'
ODCONA           EQU  H'0F0F'
WPUA             EQU  H'0F10'
ANSELA           EQU  H'0F11'
IOCBF            EQU  H'0F12'
IOCBN            EQU  H'0F13'
IOCBP            EQU  H'0F14'
INLVLB           EQU  H'0F15'
SLRCONB          EQU  H'0F16'
ODCONB           EQU  H'0F17'
WPUB             EQU  H'0F18'
ANSELB           EQU  H'0F19'
IOCCF            EQU  H'0F1A'
IOCCN            EQU  H'0F1B'
IOCCP            EQU  H'0F1C'
INLVLC           EQU  H'0F1D'
SLRCONC          EQU  H'0F1E'
ODCONC           EQU  H'0F1F'
WPUC             EQU  H'0F20'
ANSELC           EQU  H'0F21'
IOCEF            EQU  H'0F27'
IOCEN            EQU  H'0F28'
IOCEP            EQU  H'0F29'
INLVLE           EQU  H'0F2A'
WPUE             EQU  H'0F2D'
HLVDCON0         EQU  H'0F2F'
HLVDCON1         EQU  H'0F30'
FVRCON           EQU  H'0F31'
ZCDCON           EQU  H'0F32'
DAC1CON0         EQU  H'0F33'
DAC1CON1         EQU  H'0F34'
CM2CON0          EQU  H'0F35'
CM2CON1          EQU  H'0F36'
CM2NCH           EQU  H'0F37'
CM2PCH           EQU  H'0F38'
CM1CON0          EQU  H'0F39'
CM1CON1          EQU  H'0F3A'
CM1NCH           EQU  H'0F3B'
CM1PCH           EQU  H'0F3C'
CMOUT            EQU  H'0F3D'
CLKRCON          EQU  H'0F3E'
CLKRCLK          EQU  H'0F3F'
CWG1CLKCON       EQU  H'0F40'
CWG1ISM          EQU  H'0F41'
CWG1DBR          EQU  H'0F42'
CWG1DBF          EQU  H'0F43'
CWG1CON0         EQU  H'0F44'
CWG1CON1         EQU  H'0F45'
CWG1AS0          EQU  H'0F46'
CWG1AS1          EQU  H'0F47'
CWG1STR          EQU  H'0F48'
SCANLADR         EQU  H'0F49'
SCANLADRL        EQU  H'0F49'
SCANLADRH        EQU  H'0F4A'
SCANLADRU        EQU  H'0F4B'
SCANHADR         EQU  H'0F4C'
SCANHADRL        EQU  H'0F4C'
SCANHADRH        EQU  H'0F4D'
SCANHADRU        EQU  H'0F4E'
SCANCON0         EQU  H'0F4F'
SCANTRIG         EQU  H'0F50'
MDCON0           EQU  H'0F51'
MDCON1           EQU  H'0F52'
MDSRC            EQU  H'0F53'
MDCARL           EQU  H'0F54'
MDCARH           EQU  H'0F55'
ADACT            EQU  H'0F56'
ADCLK            EQU  H'0F57'
ADREF            EQU  H'0F58'
ADCON1           EQU  H'0F59'
ADCON2           EQU  H'0F5A'
ADCON3           EQU  H'0F5B'
ADACQ            EQU  H'0F5C'
ADCAP            EQU  H'0F5D'
ADPRE            EQU  H'0F5E'
ADPCH            EQU  H'0F5F'
ADCON0           EQU  H'0F60'
ADPREV           EQU  H'0F61'
ADPREVL          EQU  H'0F61'
ADPREVH          EQU  H'0F62'
ADRES            EQU  H'0F63'
ADRESL           EQU  H'0F63'
ADRESH           EQU  H'0F64'
ADSTAT           EQU  H'0F65'
ADRPT            EQU  H'0F66'
ADCNT            EQU  H'0F67'
ADSTPT           EQU  H'0F68'
ADSTPTL          EQU  H'0F68'
ADSTPTH          EQU  H'0F69'
ADLTH            EQU  H'0F6A'
ADLTHL           EQU  H'0F6A'
ADLTHH           EQU  H'0F6B'
ADUTH            EQU  H'0F6C'
ADUTHL           EQU  H'0F6C'
ADUTHH           EQU  H'0F6D'
ADERR            EQU  H'0F6E'
ADERRL           EQU  H'0F6E'
ADERRH           EQU  H'0F6F'
ADACC            EQU  H'0F70'
ADACCL           EQU  H'0F70'
ADACCH           EQU  H'0F71'
ADFLTR           EQU  H'0F72'
ADFLTRL          EQU  H'0F72'
ADFLTRH          EQU  H'0F73'
CRCDATA          EQU  H'0F74'
CRCDATL          EQU  H'0F74'
CRCDATH          EQU  H'0F75'
CRCACC           EQU  H'0F76'
CRCACCL          EQU  H'0F76'
CRCACCH          EQU  H'0F77'
CRCSHFT          EQU  H'0F78'
CRCSHIFTL        EQU  H'0F78'
CRCSHIFTH        EQU  H'0F79'
CRCXOR           EQU  H'0F7A'
CRCXORL          EQU  H'0F7A'
CRCXORH          EQU  H'0F7B'
CRCCON0          EQU  H'0F7C'
CRCCON1          EQU  H'0F7D'
NVMADR           EQU  H'0F7E'
NVMADRL          EQU  H'0F7E'
NVMDAT           EQU  H'0F80'
NVMCON1          EQU  H'0F81'
NVMCON2          EQU  H'0F82'
LATA             EQU  H'0F83'
LATB             EQU  H'0F84'
LATC             EQU  H'0F85'
DDRA             EQU  H'0F88'
TRISA            EQU  H'0F88'
DDRB             EQU  H'0F89'
TRISB            EQU  H'0F89'
DDRC             EQU  H'0F8A'
TRISC            EQU  H'0F8A'
PORTA            EQU  H'0F8D'
PORTB            EQU  H'0F8E'
PORTC            EQU  H'0F8F'
PORTE            EQU  H'0F91'
SSP1BUF          EQU  H'0F92'
SSP1ADD          EQU  H'0F93'
SSP1MSK          EQU  H'0F94'
SSP1STAT         EQU  H'0F95'
SSP1CON1         EQU  H'0F96'
SSP1CON2         EQU  H'0F97'
SSP1CON3         EQU  H'0F98'
RC1REG           EQU  H'0F99'
RCREG            EQU  H'0F99'
RCREG1           EQU  H'0F99'
TX1REG           EQU  H'0F9A'
TXREG            EQU  H'0F9A'
TXREG1           EQU  H'0F9A'
SP1BRG           EQU  H'0F9B'
SP1BRGL          EQU  H'0F9B'
SPBRG            EQU  H'0F9B'
SPBRG1           EQU  H'0F9B'
SPBRGL           EQU  H'0F9B'
SP1BRGH          EQU  H'0F9C'
SPBRGH           EQU  H'0F9C'
SPBRGH1          EQU  H'0F9C'
RC1STA           EQU  H'0F9D'
RCSTA            EQU  H'0F9D'
RCSTA1           EQU  H'0F9D'
TX1STA           EQU  H'0F9E'
TXSTA            EQU  H'0F9E'
TXSTA1           EQU  H'0F9E'
BAUD1CON         EQU  H'0F9F'
BAUDCON          EQU  H'0F9F'
BAUDCON1         EQU  H'0F9F'
BAUDCTL          EQU  H'0F9F'
BAUDCTL1         EQU  H'0F9F'
PWM4DCL          EQU  H'0FA0'
PWM4DCH          EQU  H'0FA1'
PWM4CON          EQU  H'0FA2'
PWM3DCL          EQU  H'0FA3'
PWM3DCH          EQU  H'0FA4'
PWM3CON          EQU  H'0FA5'
CCPR2            EQU  H'0FA6'
CCPR2L           EQU  H'0FA6'
CCPR2H           EQU  H'0FA7'
CCP2CON          EQU  H'0FA8'
CCP2CAP          EQU  H'0FA9'
CCPR1            EQU  H'0FAA'
CCPR1L           EQU  H'0FAA'
CCPR1H           EQU  H'0FAB'
CCP1CON          EQU  H'0FAC'
CCP1CAP          EQU  H'0FAD'
CCPTMRS          EQU  H'0FAE'
T6TMR            EQU  H'0FAF'
TMR6             EQU  H'0FAF'
PR6              EQU  H'0FB0'
T6PR             EQU  H'0FB0'
T6CON            EQU  H'0FB1'
T6HLT            EQU  H'0FB2'
T6CLKCON         EQU  H'0FB3'
T6RST            EQU  H'0FB4'
T4TMR            EQU  H'0FB5'
TMR4             EQU  H'0FB5'
PR4              EQU  H'0FB6'
T4PR             EQU  H'0FB6'
T4CON            EQU  H'0FB7'
T4HLT            EQU  H'0FB8'
T4CLKCON         EQU  H'0FB9'
T4RST            EQU  H'0FBA'
T2TMR            EQU  H'0FBB'
TMR2             EQU  H'0FBB'
PR2              EQU  H'0FBC'
T2PR             EQU  H'0FBC'
T2CON            EQU  H'0FBD'
T2HLT            EQU  H'0FBE'
T2CLKCON         EQU  H'0FBF'
T2RST            EQU  H'0FC0'
TMR5L            EQU  H'0FC1'
TMR5H            EQU  H'0FC2'
T5CON            EQU  H'0FC3'
PR5              EQU  H'0FC4'
T5GCON           EQU  H'0FC4'
T5GATE           EQU  H'0FC5'
TMR5GATE         EQU  H'0FC5'
T5CLK            EQU  H'0FC6'
TMR5CLK          EQU  H'0FC6'
TMR3L            EQU  H'0FC7'
TMR3H            EQU  H'0FC8'
T3CON            EQU  H'0FC9'
PR3              EQU  H'0FCA'
T3GCON           EQU  H'0FCA'
T3GATE           EQU  H'0FCB'
TMR3GATE         EQU  H'0FCB'
T3CLK            EQU  H'0FCC'
TMR3CLK          EQU  H'0FCC'
TMR1L            EQU  H'0FCD'
TMR1H            EQU  H'0FCE'
T1CON            EQU  H'0FCF'
PR1              EQU  H'0FD0'
T1GCON           EQU  H'0FD0'
T1GATE           EQU  H'0FD1'
TMR1GATE         EQU  H'0FD1'
T1CLK            EQU  H'0FD2'
TMR1CLK          EQU  H'0FD2'
TMR0             EQU  H'0FD3'
TMR0L            EQU  H'0FD3'
PR0              EQU  H'0FD4'
TMR0H            EQU  H'0FD4'
T0CON0           EQU  H'0FD5'
T0CON1           EQU  H'0FD6'
PCON0            EQU  H'0FD7'
STATUS           EQU  H'0FD8'
FSR2L            EQU  H'0FD9'
FSR2H            EQU  H'0FDA'
PLUSW2           EQU  H'0FDB'
PREINC2          EQU  H'0FDC'
POSTDEC2         EQU  H'0FDD'
POSTINC2         EQU  H'0FDE'
INDF2            EQU  H'0FDF'
BSR              EQU  H'0FE0'
FSR1L            EQU  H'0FE1'
FSR1H            EQU  H'0FE2'
PLUSW1           EQU  H'0FE3'
PREINC1          EQU  H'0FE4'
POSTDEC1         EQU  H'0FE5'
POSTINC1         EQU  H'0FE6'
INDF1            EQU  H'0FE7'
WREG             EQU  H'0FE8'
FSR0L            EQU  H'0FE9'
FSR0H            EQU  H'0FEA'
PLUSW0           EQU  H'0FEB'
PREINC0          EQU  H'0FEC'
POSTDEC0         EQU  H'0FED'
POSTINC0         EQU  H'0FEE'
INDF0            EQU  H'0FEF'
INTCON           EQU  H'0FF2'
PROD             EQU  H'0FF3'
PRODL            EQU  H'0FF3'
PRODH            EQU  H'0FF4'
TABLAT           EQU  H'0FF5'
TBLPTR           EQU  H'0FF6'
TBLPTRL          EQU  H'0FF6'
TBLPTRH          EQU  H'0FF7'
TBLPTRU          EQU  H'0FF8'
PC               EQU  H'0FF9'
PCL              EQU  H'0FF9'
PCLATH           EQU  H'0FFA'
PCLATU           EQU  H'0FFB'
STKPTR           EQU  H'0FFC'
TOS              EQU  H'0FFD'
TOSL             EQU  H'0FFD'
TOSH             EQU  H'0FFE'
TOSU             EQU  H'0FFF'

;----- PPSLOCK Bits -----------------------------------------------------
PPSLOCKED        EQU  H'0000'


;----- INT0PPS Bits -----------------------------------------------------
INT0PPS0         EQU  H'0000'
INT0PPS1         EQU  H'0001'
INT0PPS2         EQU  H'0002'
INT0PPS3         EQU  H'0003'
INT0PPS4         EQU  H'0004'


;----- INT1PPS Bits -----------------------------------------------------
INT1PPS0         EQU  H'0000'
INT1PPS1         EQU  H'0001'
INT1PPS2         EQU  H'0002'
INT1PPS3         EQU  H'0003'
INT1PPS4         EQU  H'0004'


;----- INT2PPS Bits -----------------------------------------------------
INT2PPS0         EQU  H'0000'
INT2PPS1         EQU  H'0001'
INT2PPS2         EQU  H'0002'
INT2PPS3         EQU  H'0003'
INT2PPS4         EQU  H'0004'


;----- T0CKIPPS Bits -----------------------------------------------------
T0CKIPPS0        EQU  H'0000'
T0CKIPPS1        EQU  H'0001'
T0CKIPPS2        EQU  H'0002'
T0CKIPPS3        EQU  H'0003'
T0CKIPPS4        EQU  H'0004'


;----- T1CKIPPS Bits -----------------------------------------------------
T1CKIPPS0        EQU  H'0000'
T1CKIPPS1        EQU  H'0001'
T1CKIPPS2        EQU  H'0002'
T1CKIPPS3        EQU  H'0003'
T1CKIPPS4        EQU  H'0004'


;----- T1GPPS Bits -----------------------------------------------------
T1GPPS0          EQU  H'0000'
T1GPPS1          EQU  H'0001'
T1GPPS2          EQU  H'0002'
T1GPPS3          EQU  H'0003'
T1GPPS4          EQU  H'0004'


;----- T3CKIPPS Bits -----------------------------------------------------
T3CKIPPS0        EQU  H'0000'
T3CKIPPS1        EQU  H'0001'
T3CKIPPS2        EQU  H'0002'
T3CKIPPS3        EQU  H'0003'
T3CKIPPS4        EQU  H'0004'


